
# ELBRUSE Bootcamp 
# 13-02-2025
# Week 9 Day 4 Project
# team: Dasha, Alina, Ilya, Andrey 


import streamlit as st
import pandas as pd


#st.title('Страница 01')
st.title('Описание Проекта ')
st.title('Computer vision project • Faster-RCNN team')
st.subheader('План проекта: ')
st.write('0. В соответствии с инструкцией создайте git-репозиторий cv_project и добавьте туда членов команды.')
st.write('1. Разработайте multipage-приложение с использованием streamlit:')
st.write(' - Детекция лиц с помощью любой версии YOLO c последующей маскировкой детектированной области (пример)')
st.write(' - Детекция объектов с помощью YOLOv8-v11: датасет для детекции ветрогенераторов')
st.write(' - Примените модель Unet к задаче семантической сегментации аэрокосмических снимков')
st.write('2. Применить стандартную структуру директорий  проекта')

st.write('3. Требования к приложению')
st.write(' - Все страницы должны поддерживать загрузку пользователем сразу нескольких файлов.')
st.write(' - Страница с детекцией объектов должна поддерживать подгрузку файла по прямой ссылке.')
st.write(' - Все страницы должны иметь раздел с информацией о моделях, качестве и процессе обучения: ')
st.write('    --  Число эпох обучения')
st.write('    --  Число эпох обучения')
st.write('    --  Объем выборок')
st.write('    --  Метрики (для детекции mAP, график PR кривой, confusion matrix и т.д.)')














